references/todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-05 ven. 17:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="teddd" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga18be50">1. work environment</a>
<ul>
<li><a href="#org4266699">1.1. yas</a>
<ul>
<li><a href="#org5a039a3">1.1.1. #+name:</a></li>
</ul>
</li>
<li><a href="#orgdb7fb13">1.2. Project file system</a>
<ul>
<li><a href="#org5caeb8c">1.2.1. <span class="todo TODO">TODO</span> set PATH env</a></li>
</ul>
</li>
<li><a href="#org568e4c6">1.3. org babel</a>
<ul>
<li><a href="#orgae9da24">1.3.1. ob : print tables</a></li>
<li><a href="#org70cdf7d">1.3.2. ob : imports at the top</a></li>
<li><a href="#orgc7ba464">1.3.3. <span class="todo TODO">TODO</span> tag subtrees to trigger different action on eval / tangling</a></li>
<li><a href="#orgf4d24c6">1.3.4. change prefix key</a></li>
<li><a href="#org3373b3a">1.3.5. <span class="todo TODO">TODO</span> go to discussion on mailing list / stack exchange</a></li>
<li><a href="#orgcaec5d8">1.3.6. code fonts</a></li>
<li><a href="#org301301c">1.3.7. org database</a></li>
</ul>
</li>
<li><a href="#org32fab79">1.4. python kernel interaction</a>
<ul>
<li><a href="#org6f91698">1.4.1. <span class="todo TODO">TODO</span> python debugging</a></li>
<li><a href="#orgc59921c">1.4.2. <span class="todo TODO">TODO</span> ob-ipython / jupyter kernel</a></li>
<li><a href="#org6b5b0ea">1.4.3. <span class="todo TODO">TODO</span> set env</a></li>
</ul>
</li>
<li><a href="#org00c0d4b">1.5. Scimax test / merge</a>
<ul>
<li><a href="#org79c8334">1.5.1. run scimax as standalone</a></li>
<li><a href="#org916fbff">1.5.2. implement whole scimax and remove bit by bit what is buggy</a></li>
<li><a href="#orgbce90fa">1.5.3. implement scimax piece by piece</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8812309">2. Work directions</a>
<ul>
<li><a href="#org6d36de6">2.1. Visualization</a></li>
<li><a href="#orge15f1ae">2.2. Big Data NLP</a>
<ul>
<li><a href="#orgd0a047f">2.2.1. Clean data</a></li>
<li><a href="#orga193c95">2.2.2. spark / hive</a></li>
<li><a href="#orgcdb7515">2.2.3. Clustering</a></li>
</ul>
</li>
<li><a href="#org18cae44">2.3. <span class="todo TODO">TODO</span> store, browse and classify offers from different time/origin</a>
<ul>
<li><a href="#org003208d">2.3.1. <span class="todo TODO">TODO</span> scraper pipeline</a></li>
<li><a href="#org36ae68d">2.3.2. Matcher program</a></li>
<li><a href="#org76fa175">2.3.3. news alert system</a></li>
</ul>
</li>
<li><a href="#org96b2eea">2.4. <span class="todo TODO">TODO</span> browse offers</a>
<ul>
<li><a href="#org2f0b2d5">2.4.1. sql generated table</a></li>
<li><a href="#orgfc41fcd">2.4.2. generated on view by a server ?</a></li>
<li><a href="#orgc069f7e">2.4.3. show in a browser</a></li>
<li><a href="#org4c94a80">2.4.4. browse on by one</a></li>
<li><a href="#orgc3cebe6">2.4.5. export to a file / hyperlinked filesystem</a></li>
<li><a href="#orge4e45db">2.4.6. emacs mode / standalone lightweight emacs distribution</a></li>
<li><a href="#orgbf84d75">2.4.7. index page with redirect  links to original offers ?</a></li>
</ul>
</li>
<li><a href="#org3db2bf8">2.5. Environment</a></li>
<li><a href="#org5527713">2.6. SQL database</a></li>
<li><a href="#orge8f3ee6">2.7. scrapper</a></li>
<li><a href="#org84452cc">2.8. frontend</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga18be50" class="outline-2">
<h2 id="orga18be50"><span class="section-number-2">1</span> work environment</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4266699" class="outline-3">
<h3 id="org4266699"><span class="section-number-3">1.1</span> yas</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5a039a3" class="outline-4">
<h4 id="org5a039a3"><span class="section-number-4">1.1.1</span> #+name:</h4>
</div>
</div>
<div id="outline-container-orgdb7fb13" class="outline-3">
<h3 id="orgdb7fb13"><span class="section-number-3">1.2</span> Project file system</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5caeb8c" class="outline-4">
<h4 id="org5caeb8c"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> set PATH env</h4>
</div>
</div>
<div id="outline-container-org568e4c6" class="outline-3">
<h3 id="org568e4c6"><span class="section-number-3">1.3</span> org babel</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgae9da24" class="outline-4">
<h4 id="orgae9da24"><span class="section-number-4">1.3.1</span> ob : print tables</h4>
</div>
<div id="outline-container-org70cdf7d" class="outline-4">
<h4 id="org70cdf7d"><span class="section-number-4">1.3.2</span> ob : imports at the top</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="orgc831b02"></a>use noweb ?<br /></li>
<li><a id="orgd0d2865"></a><span class="todo TODO">TODO</span> preamble<br /></li>
</ol>
</div>
<div id="outline-container-orgc7ba464" class="outline-4">
<h4 id="orgc7ba464"><span class="section-number-4">1.3.3</span> <span class="todo TODO">TODO</span> tag subtrees to trigger different action on eval / tangling</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<ol class="org-ol">
<li><a id="orgc35065e"></a>tag filter view / generated file/buffer<br /></li>
</ol>
</div>
<div id="outline-container-orgf4d24c6" class="outline-4">
<h4 id="orgf4d24c6"><span class="section-number-4">1.3.4</span> change prefix key</h4>
</div>
<div id="outline-container-org3373b3a" class="outline-4">
<h4 id="org3373b3a"><span class="section-number-4">1.3.5</span> <span class="todo TODO">TODO</span> go to discussion on mailing list / stack exchange</h4>
</div>
<div id="outline-container-orgcaec5d8" class="outline-4">
<h4 id="orgcaec5d8"><span class="section-number-4">1.3.6</span> code fonts</h4>
<div class="outline-text-4" id="text-1-3-6">
</div>
<ol class="org-ol">
<li><a id="org91b4b4b"></a>scimax<br /></li>
</ol>
</div>
<div id="outline-container-org301301c" class="outline-4">
<h4 id="org301301c"><span class="section-number-4">1.3.7</span> org database</h4>
</div>
</div>
<div id="outline-container-org32fab79" class="outline-3">
<h3 id="org32fab79"><span class="section-number-3">1.4</span> python kernel interaction</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org6f91698" class="outline-4">
<h4 id="org6f91698"><span class="section-number-4">1.4.1</span> <span class="todo TODO">TODO</span> python debugging</h4>
</div>
<div id="outline-container-orgc59921c" class="outline-4">
<h4 id="orgc59921c"><span class="section-number-4">1.4.2</span> <span class="todo TODO">TODO</span> ob-ipython / jupyter kernel</h4>
<div class="outline-text-4" id="text-1-4-2">
</div>
<ol class="org-ol">
<li><a id="org459df5f"></a>add scimax extensions<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
<a href="https://github.com/jkitchin/scimax/blob/master/scimax-org-babel-ipython.el">https://github.com/jkitchin/scimax/blob/master/scimax-org-babel-ipython.el</a>
</p>
</div>
</li>
<li><a id="org7e1468f"></a>access running kernels<br /></li>
<li><a id="org21dc8a7"></a>find a way to make jupyter run on python3<br />
<ol class="org-ol">
<li><a id="org1428317"></a>for now, using ipython3 console in ob-ipython<br /></li>
<li><a id="org68a1770"></a>add something to :session<br /></li>
<li><a id="org88403d7"></a>add :kernel<br /></li>
<li><a id="orgc956494"></a>run jupyter in different envs<br />
<div class="outline-text-6" id="text-1-4-2-3-4">
<p>
then do :
</p>
<ol class="org-ol">
<li>start in a shell jupyter-console</li>
<li>copy the json filename from /run/user/1000/jupyter to :session argument in the source code header.</li>
</ol>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org6b5b0ea" class="outline-4">
<h4 id="org6b5b0ea"><span class="section-number-4">1.4.3</span> <span class="todo TODO">TODO</span> set env</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org28b46b9"></a><span class="todo TODO">TODO</span> choose for each session<br />
<ol class="org-ol">
<li><a id="org5e9f9bc"></a>run jupyter kernels in different envs<br /></li>
</ol>
</li>
<li><a id="orgec283b7"></a><span class="done DONE">DONE</span> manage different environments with envwrapper<br />
<div class="outline-text-5" id="text-1-4-3-2">
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org00c0d4b" class="outline-3">
<h3 id="org00c0d4b"><span class="section-number-3">1.5</span> Scimax test / merge</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org79c8334" class="outline-4">
<h4 id="org79c8334"><span class="section-number-4">1.5.1</span> run scimax as standalone</h4>
</div>
<div id="outline-container-org916fbff" class="outline-4">
<h4 id="org916fbff"><span class="section-number-4">1.5.2</span> implement whole scimax and remove bit by bit what is buggy</h4>
</div>
<div id="outline-container-orgbce90fa" class="outline-4">
<h4 id="orgbce90fa"><span class="section-number-4">1.5.3</span> implement scimax piece by piece</h4>
</div>
</div>
</div>
<div id="outline-container-org8812309" class="outline-2">
<h2 id="org8812309"><span class="section-number-2">2</span> Work directions</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6d36de6" class="outline-3">
<h3 id="org6d36de6"><span class="section-number-3">2.1</span> Visualization</h3>
</div>
<div id="outline-container-orge15f1ae" class="outline-3">
<h3 id="orge15f1ae"><span class="section-number-3">2.2</span> Big Data NLP</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgd0a047f" class="outline-4">
<h4 id="orgd0a047f"><span class="section-number-4">2.2.1</span> Clean data</h4>
</div>
<div id="outline-container-orga193c95" class="outline-4">
<h4 id="orga193c95"><span class="section-number-4">2.2.2</span> spark / hive</h4>
</div>
<div id="outline-container-orgcdb7515" class="outline-4">
<h4 id="orgcdb7515"><span class="section-number-4">2.2.3</span> Clustering</h4>
</div>
</div>
<div id="outline-container-org18cae44" class="outline-3">
<h3 id="org18cae44"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> store, browse and classify offers from different time/origin</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org003208d" class="outline-4">
<h4 id="org003208d"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> scraper pipeline</h4>
<div class="outline-text-4" id="text-2-3-1">
</div>
<ol class="org-ol">
<li><a id="orga59591f"></a>store in a database and gain acces to it<br /></li>
<li><a id="org6717335"></a>check date before crawling page<br /></li>
<li><a id="org6f1b674"></a>test matcher on title before crawling page<br /></li>
<li><a id="org6cf791f"></a>if match but different query/website add to "original query/website" list<br /></li>
<li><a id="orgfd68098"></a>new variables<br />
<ol class="org-ol">
<li><a id="org7116853"></a>date of scrap<br /></li>
<li><a id="org9a0d413"></a>post dates (if different matches / reposts)<br />
<ol class="org-ol">
<li><a id="org97afdbd"></a>new / repost<br /></li>
<li><a id="org922ee2a"></a>most recent date<br /></li>
</ol>
</li>
<li><a id="orgfe8e699"></a>original website<br /></li>
<li><a id="org4745424"></a>queries<br /></li>
<li><a id="orgf797d94"></a>read / unread<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org36ae68d" class="outline-4">
<h4 id="org36ae68d"><span class="section-number-4">2.3.2</span> Matcher program</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ol class="org-ol">
<li><a id="org27c5f40"></a>run benchmark test to compare speed of different programs<br />
<ol class="org-ol">
<li><a id="org0b00651"></a>pandas dataframes<br /></li>
<li><a id="org0b58331"></a>sql<br /></li>
<li><a id="org55388f3"></a>no sql<br /></li>
<li><a id="orgae217f2"></a>c<br /></li>
</ol>
</li>
<li><a id="org02ee176"></a>comparison methods<br />
<ol class="org-ol">
<li><a id="orgab52125"></a>similarity rate<br /></li>
<li><a id="orgfb35fcf"></a>hash tables / id<br /></li>
</ol>
</li>
<li><a id="org84a15fd"></a>matching criterium<br />
<ol class="org-ol">
<li><a id="org90bd090"></a>is date &amp; firm &amp; title<br /></li>
<li><a id="org6d19774"></a>title is not too common<br /></li>
<li><a id="orgc99afd0"></a>run tests<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org76fa175" class="outline-4">
<h4 id="org76fa175"><span class="section-number-4">2.3.3</span> news alert system</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ol class="org-ol">
<li><a id="org78b37bc"></a>filter : rating value of a job<br />
<ol class="org-ol">
<li><a id="orgea643a3"></a>criterium<br />
<ol class="org-ol">
<li><a id="org7532698"></a>short term<br />
<ol class="org-ol">
<li><a id="org6c46abe"></a>contract<br /></li>
<li><a id="org05ede4c"></a>salary<br /></li>
<li><a id="org01f4109"></a>domain<br /></li>
<li><a id="org60d5e8c"></a>location<br /></li>
</ol>
</li>
<li><a id="orgb182fff"></a>long term<br />
<ol class="org-ol">
<li><a id="orgf5304f7"></a>career<br /></li>
<li><a id="orgbf7578c"></a>knowledge<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgf81c975"></a>find data from other sources<br /></li>
<li><a id="orgd5cedd8"></a>concentrate on available data for now<br /></li>
</ol>
</li>
<li><a id="org19cd09e"></a>UX<br />
<ol class="org-ol">
<li><a id="orgf9dc221"></a>overview<br />
<ol class="org-ol">
<li><a id="orgef4d60b"></a>number of new offers<br /></li>
<li><a id="orgfa955eb"></a>print titles<br /></li>
</ol>
</li>
<li><a id="org4198317"></a>browse offers<br /></li>
<li><a id="org4a899cc"></a>rate<br /></li>
<li><a id="org8103691"></a>features valuation<br /></li>
<li><a id="org45f98a9"></a>keywords valuation<br />
<ol class="org-ol">
<li><a id="orgfe72def"></a>banned<br /></li>
<li><a id="orgdad8dd0"></a>needed<br /></li>
<li><a id="orgb3cbb17"></a>quckly give a weight to each word<br /></li>
</ol>
</li>
</ol>
</li>
<li><a id="orgc618d1d"></a>Process<br />
<ol class="org-ol">
<li><a id="org697ed2b"></a>Add new interesting offer to a queue<br /></li>
<li><a id="org9de1739"></a>News / RSS / Mail model ?<br /></li>
</ol>
</li>
<li><a id="org8f00986"></a>run as a daemon on a server<br /></li>
<li><a id="org5ec5be5"></a>send sms with a link<br /></li>
<li><a id="orgb1b3106"></a>generate html ?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org96b2eea" class="outline-3">
<h3 id="org96b2eea"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> browse offers</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org2f0b2d5" class="outline-4">
<h4 id="org2f0b2d5"><span class="section-number-4">2.4.1</span> sql generated table</h4>
</div>
<div id="outline-container-orgfc41fcd" class="outline-4">
<h4 id="orgfc41fcd"><span class="section-number-4">2.4.2</span> generated on view by a server ?</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
<a href="http://kitchingroup.cheme.cmu.edu/blog/2017/01/03/Find-stuff-in-org-mode-anywhere/">http://kitchingroup.cheme.cmu.edu/blog/2017/01/03/Find-stuff-in-org-mode-anywhere/</a>
</p>
</div>
</div>
<div id="outline-container-orgc069f7e" class="outline-4">
<h4 id="orgc069f7e"><span class="section-number-4">2.4.3</span> show in a browser</h4>
<div class="outline-text-4" id="text-2-4-3">
</div>
<ol class="org-ol">
<li><a id="orgb40536c"></a>java app ?<br /></li>
</ol>
</div>
<div id="outline-container-org4c94a80" class="outline-4">
<h4 id="org4c94a80"><span class="section-number-4">2.4.4</span> browse on by one</h4>
</div>
<div id="outline-container-orgc3cebe6" class="outline-4">
<h4 id="orgc3cebe6"><span class="section-number-4">2.4.5</span> export to a file / hyperlinked filesystem</h4>
<div class="outline-text-4" id="text-2-4-5">
</div>
<ol class="org-ol">
<li><a id="org9f84ce3"></a>pdf one job a page<br /></li>
<li><a id="orgf890edc"></a>Custom column/agenda view ?<br /></li>
<li><a id="org0f061fd"></a>org file ?<br />
<ol class="org-ol">
<li><a id="orgeaa1474"></a><span class="todo TODO">TODO</span> generate html<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orge4e45db" class="outline-4">
<h4 id="orge4e45db"><span class="section-number-4">2.4.6</span> emacs mode / standalone lightweight emacs distribution</h4>
</div>
<div id="outline-container-orgbf84d75" class="outline-4">
<h4 id="orgbf84d75"><span class="section-number-4">2.4.7</span> index page with redirect  links to original offers ?</h4>
</div>
</div>
<div id="outline-container-org3db2bf8" class="outline-3">
<h3 id="org3db2bf8"><span class="section-number-3">2.5</span> Environment</h3>
</div>
<div id="outline-container-org5527713" class="outline-3">
<h3 id="org5527713"><span class="section-number-3">2.6</span> SQL database</h3>
</div>
<div id="outline-container-orge8f3ee6" class="outline-3">
<h3 id="orge8f3ee6"><span class="section-number-3">2.7</span> scrapper</h3>
</div>
<div id="outline-container-org84452cc" class="outline-3">
<h3 id="org84452cc"><span class="section-number-3">2.8</span> frontend</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: teddd</p>
<p class="date">Created: 2018-10-05 ven. 17:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
